Revit 2027 API
ThermalAsset.ElectricalResistivity Property
 The electrical resistivity of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ElectricalResistivity { get; set; }
Public Property ElectricalResistivity As Double
	Get
	Set
public:
property double ElectricalResistivity {
	double get ();
	void set (double value);
}
member ElectricalResistivity : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for electricalResistivity must be non-negative.
Remarks
 Values are in ohm-meters and must be non-negative.
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace